In [2]:
import pandas as pd

In [3]:
uname = ['UserID', 'gender', 'age', 'occuoation', 'Zip-code']

In [4]:
users = pd.read_table("users.dat", sep = "::", engine ='python', names = uname)

In [5]:
users

      UserID gender  age  occuoation Zip-code
0          1      F    1          10    48067
1          2      M   56          16    70072
2          3      M   25          15    55117
3          4      M   45           7    02460
4          5      M   25          20    55455
...      ...    ...  ...         ...      ...
6035    6036      F   25          15    32603
6036    6037      F   45           1    76006
6037    6038      F   56           1    14706
6038    6039      F   45           0    01060
6039    6040      M   25           6    11106

[6040 rows x 5 columns]

In [6]:
mov_col = ['MovieID', 'Titel', 'Genres']

In [7]:
movies = pd.read_table("movies.dat", sep = "::", engine = 'python', names = mov_col, encoding = "ISO-8859-1")

In [8]:
movies

,MovieID,Titel,Genres
0,1,Toy Story (1995),Animation|Children's|Comedy
1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
3878,3948,Meet the Parents (2000),Comedy
3879,3949,Requiem for a Dream (2000),Drama
3880,3950,Tigerland (2000),Drama
3881,3951,Two Family House (2000),Drama
3882,3952,"Contender, The (2000)",Drama|Thriller

In [9]:
rat_col = ['UserID','MovieID','Rating','Timestamp']

In [10]:
ratings = pd.read_table("ratings.dat", sep = "::", engine = 'python', names = rat_col)

In [11]:
ratings

         UserID  MovieID  Rating  Timestamp
0             1     1193       5  978300760
1             1      661       3  978302109
2             1      914       3  978301968
3             1     3408       4  978300275
4             1     2355       5  978824291
...         ...      ...     ...        ...
1000204    6040     1091       1  956716541
1000205    6040     1094       5  956704887
1000206    6040      562       5  956704746
1000207    6040     1096       4  956715648
1000208    6040     1097       4  956715569

[1000209 rows x 4 columns]

In [12]:
dataFrame = ratings.merge(users, how = 'inner', on = uname[0]).merge(movies, how = 'inner', on = mov_col[0])

In [16]:
groupedF = groupFemale.sort_values(by = ['age', 'Rating'], ascending=False).groupby(['age','Titel']).first(10)

In [55]:
only_Male = under_18_Group[under_18_Group['gender']=='M']

In [63]:
only_Male.groupby(['Titel'])[['Rating']].sum().sort_values(by=['Rating'], ascending=False).head(10)

                                                    Rating
Titel
Matrix, The (1999)                                     368
Sixth Sense, The (1999)                                335
Star Wars: Episode IV - A New Hope (1977)              327
Star Wars: Episode VI - Return of the Jedi (1983)      315
Star Wars: Episode V - The Empire Strikes Back ...     308
Saving Private Ryan (1998)                             302
American Beauty (1999)                                 287
Toy Story (1995)                                       280
Men in Black (1997)                                    270
Toy Story 2 (1999)                                     264

In [64]:
only_Male = between_18_24_Group[between_18_24_Group['gender']=='M']

In [65]:
only_Male.groupby(['Titel'])[['Rating']].sum().sort_values(by=['Rating'], ascending=False).head(10)

                                                    Rating
Titel
American Beauty (1999)                                2402
Star Wars: Episode V - The Empire Strikes Back ...    2068
Matrix, The (1999)                                    2027
Star Wars: Episode IV - A New Hope (1977)             2015
Star Wars: Episode VI - Return of the Jedi (1983)     1949
Braveheart (1995)                                     1923
Saving Private Ryan (1998)                            1874
Terminator 2: Judgment Day (1991)                     1812
Sixth Sense, The (1999)                               1657
Raiders of the Lost Ark (1981)                        1647

In [66]:
only_Male = between_25_34_Group[between_25_34_Group['gender']=='M']

In [67]:
only_Male.groupby(['Titel'])[['Rating']].sum().sort_values(by=['Rating'], ascending=False).head(10)

                                                    Rating
Titel
American Beauty (1999)                                4238
Star Wars: Episode IV - A New Hope (1977)             4148
Star Wars: Episode V - The Empire Strikes Back ...    4140
Matrix, The (1999)                                    3773
Terminator 2: Judgment Day (1991)                     3664
Star Wars: Episode VI - Return of the Jedi (1983)     3632
Raiders of the Lost Ark (1981)                        3534
Saving Private Ryan (1998)                            3516
Silence of the Lambs, The (1991)                      3505
Braveheart (1995)                                     3178

In [68]:
only_Male = between_35_44_Group[between_35_44_Group['gender']=='M']

In [69]:
only_Male.groupby(['Titel'])[['Rating']].sum().sort_values(by=['Rating'], ascending=False).head(10)

                                                    Rating
Titel
Star Wars: Episode IV - A New Hope (1977)             2139
Star Wars: Episode V - The Empire Strikes Back ...    1911
American Beauty (1999)                                1852
Terminator 2: Judgment Day (1991)                     1802
Saving Private Ryan (1998)                            1748
Raiders of the Lost Ark (1981)                        1740
Godfather, The (1972)                                 1645
Star Wars: Episode VI - Return of the Jedi (1983)     1645
Alien (1979)                                          1617
Matrix, The (1999)                                    1607

In [70]:
only_Male = between_45_49_Group[between_45_49_Group['gender']=='M']

In [71]:
only_Male.groupby(['Titel'])[['Rating']].sum().sort_values(by=['Rating'], ascending=False).head(10)

                                                    Rating
Titel
Star Wars: Episode IV - A New Hope (1977)              779
American Beauty (1999)                                 716
Star Wars: Episode V - The Empire Strikes Back ...     708
Godfather, The (1972)                                  685
Raiders of the Lost Ark (1981)                         671
Saving Private Ryan (1998)                             657
Schindler's List (1993)                                644
Jurassic Park (1993)                                   635
Fargo (1996)                                           633
Terminator 2: Judgment Day (1991)                      628

In [72]:
only_Male = between_50_55_Group[between_50_55_Group['gender']=='M']

In [73]:
only_Male.groupby(['Titel'])[['Rating']].sum().sort_values(by=['Rating'], ascending=False).head(10)

                                                    Rating
Titel
American Beauty (1999)                                 756
Star Wars: Episode IV - A New Hope (1977)              734
Godfather, The (1972)                                  668
Star Wars: Episode V - The Empire Strikes Back ...     651
Terminator 2: Judgment Day (1991)                      638
Saving Private Ryan (1998)                             638
Fargo (1996)                                           633
Braveheart (1995)                                      618
Butch Cassidy and the Sundance Kid (1969)              604
L.A. Confidential (1997)                               596

In [74]:
only_Male = older_56_Group[older_56_Group['gender']=='M']

In [75]:
only_Male.groupby(['Titel'])[['Rating']].sum().sort_values(by=['Rating'], ascending=False).head(10)

                                                    Rating
Titel
American Beauty (1999)                                 539
Schindler's List (1993)                                435
Godfather, The (1972)                                  415
Saving Private Ryan (1998)                             406
Fargo (1996)                                           401
Star Wars: Episode IV - A New Hope (1977)              395
Silence of the Lambs, The (1991)                       394
Shakespeare in Love (1998)                             390
Star Wars: Episode V - The Empire Strikes Back ...     389
Butch Cassidy and the Sundance Kid (1969)              374

In [78]:
only_Female = under_18_Group[under_18_Group['gender']=='F']

In [79]:
only_Female.groupby(['Titel'])[['Rating']].sum().sort_values(by=['Rating'], ascending=False).head(10)

                                   Rating
Titel
Toy Story (1995)                      159
Toy Story 2 (1999)                    152
Shakespeare in Love (1998)            141
Aladdin (1992)                        136
Sixth Sense, The (1999)               131
Forrest Gump (1994)                   128
Bug's Life, A (1998)                  124
E.T. the Extra-Terrestrial (1982)     122
American Beauty (1999)                121
Babe (1995)                           116

In [81]:
only_Female = between_18_24_Group[between_18_24_Group['gender']=='F']

In [82]:
only_Female.groupby(['Titel'])[['Rating']].sum().sort_values(by=['Rating'], ascending=False).head(10)

                                                    Rating
Titel
American Beauty (1999)                                 831
Shakespeare in Love (1998)                             609
Princess Bride, The (1987)                             609
Sixth Sense, The (1999)                                561
Shawshank Redemption, The (1994)                       557
Silence of the Lambs, The (1991)                       548
Forrest Gump (1994)                                    526
Toy Story (1995)                                       519
Schindler's List (1993)                                514
Star Wars: Episode V - The Empire Strikes Back ...     504

In [84]:
only_Female = between_25_34_Group[between_25_34_Group['gender']=='F']

In [85]:
only_Female.groupby(['Titel'])[['Rating']].sum().sort_values(by=['Rating'], ascending=False).head(10)

                                                    Rating
Titel
American Beauty (1999)                                1539
Silence of the Lambs, The (1991)                      1197
Shakespeare in Love (1998)                            1161
Princess Bride, The (1987)                            1153
Sixth Sense, The (1999)                               1096
Fargo (1996)                                          1074
Shawshank Redemption, The (1994)                      1073
Star Wars: Episode V - The Empire Strikes Back ...    1023
Star Wars: Episode IV - A New Hope (1977)             1010
Raiders of the Lost Ark (1981)                         985

In [86]:
only_Female = between_35_44_Group[between_35_44_Group['gender']=='F']

In [87]:
only_Female.groupby(['Titel'])[['Rating']].sum().sort_values(by=['Rating'], ascending=False).head(10)

                                                    Rating
Titel
American Beauty (1999)                                 674
Shakespeare in Love (1998)                             659
Silence of the Lambs, The (1991)                       653
Sixth Sense, The (1999)                                615
Star Wars: Episode IV - A New Hope (1977)              587
Fargo (1996)                                           575
Star Wars: Episode V - The Empire Strikes Back ...     573
Casablanca (1942)                                      560
Raiders of the Lost Ark (1981)                         547
Toy Story (1995)                                       546

In [88]:
only_Female = between_45_49_Group[between_45_49_Group['gender']=='F']

In [89]:
only_Female.groupby(['Titel'])[['Rating']].sum().sort_values(by=['Rating'], ascending=False).head(10)

                                           Rating
Titel
American Beauty (1999)                        355
Shakespeare in Love (1998)                    343
Schindler's List (1993)                       334
Star Wars: Episode IV - A New Hope (1977)     287
Shawshank Redemption, The (1994)              282
Silence of the Lambs, The (1991)              280
Forrest Gump (1994)                           278
Casablanca (1942)                             273
Fargo (1996)                                  269
E.T. the Extra-Terrestrial (1982)             267

In [90]:
only_Female = between_50_55_Group[between_50_55_Group['gender']=='F']

In [91]:
only_Female.groupby(['Titel'])[['Rating']].sum().sort_values(by=['Rating'], ascending=False).head(10)

                                           Rating
Titel
American Beauty (1999)                        273
Shakespeare in Love (1998)                    254
Fargo (1996)                                  242
Godfather, The (1972)                         231
Star Wars: Episode IV - A New Hope (1977)     225
Schindler's List (1993)                       224
L.A. Confidential (1997)                      221
Casablanca (1942)                             217
Shawshank Redemption, The (1994)              215
Sixth Sense, The (1999)                       206

In [92]:
only_Female = older_56_Group[older_56_Group['gender']=='F']

In [93]:
only_Female.groupby(['Titel'])[['Rating']].sum().sort_values(by=['Rating'], ascending=False).head(10)

                                        Rating
Titel
American Beauty (1999)                     217
Schindler's List (1993)                    198
One Flew Over the Cuckoo's Nest (1975)     173
Shakespeare in Love (1998)                 170
Gone with the Wind (1939)                  168
Shawshank Redemption, The (1994)           139
Forrest Gump (1994)                        138
Saving Private Ryan (1998)                 131
Godfather, The (1972)                      130
Wizard of Oz, The (1939)                   125